{
	"automation": [
		{
			"name": "Chain Linking",
			"image": "iron-chains.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"When right clicking with Chains onto a boat or minecart, and then onto another, they'll link the two. Linked boats and minecarts will always remain at close distance, which allows you to make trains.",
				"Prior to 1.16, an Iron Chain item was added by Quark. As Chains were added to the base game in 1.16, this item was removed.",
				"Quark's Iron Chains prior to 1.16 can be used to craft chainmail armor, or placed down as a block that connects perfectly to Lanterns."
			]
		},
		{
			"name": "Chute",
			"image": "chute.jpg",
			"added": "1.14",
			"desc": [
				"The Chute is a new automation block. Items can be inserted into it via automation (Hopper, Dropper, etc), and any items inserted are instantly dropped under it, always precisely in the center.",
				"The Chute can be disabled with a redstone signal or by placing a block under it."
			]
		},
		{
			"name": "Color Slime",
			"image": "color-slime.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Slime blocks can be dyed Red and Blue. The primary color blocks (Red, Green, and Blue) can be combined to create secondary colors (Cyan, Magenta, and Yellow).",
				"While being moved by pistons, two slime blocks will only connect if they're the same color, or if one is made of another (so Red won't connect to Blue, but it'll connect to Magenta). Any color of slime will connect to non-slime blocks around it normally."
			]
		},
		{
			"name": "Dispensers Place Blocks",
			"image": "dispensers-place-blocks.jpg",
			"added": "1.14",
			"desc": [
				"Dispensers are allowed to place blocks in the world. Any blocks that already had a placement behaviour, like TNT, are ignored.",
				"The blocks are rotated so they're placed forward from the dispenser. Note that crops such as Wheat Seeds or Potatoes also count."
			]
		},
		{
			"name": "Ender Watcher",
			"image": "ender-watcher.jpg", 
			"added": "1.14",
			"desc": [
				"The Ender Watcher is a new redstone input block. It emits a redstone signal if a player is looking directly at it.",
				"In 1.15+, the signal is higher the closer to the center of the block the player is looking. In previous versions, it will always emit a full signal.",
				"It's crafted with an Eye of Ender, Redstone, and Obsidian.",
				"Note: Prior to 1.18, the Ender Watcher was crafted with Biotite (from the World module) instead of Obsidian (if enabled)."
			]
		},
		{
			"name": "Feeding Trough",
			"image": "feeding-trough.jpg",
			"added": "1.14",
			"desc": [
				"The Feeding Trough is a new block you can craft with some planks and fence gates. When right clicked, a menu will pop up where you can put food inside it.",
				"Nearby animals will flock to the trough to eat the food within. This works just as if a player had fed the animal, but with a few differences:",
				"*There's a chance the animal will need more than one bit of food to get in love mode;",
				"*Animals bred with the trough will not produce XP;",
				"*If there's more than 32 animals in a 10 block radius, the animals will eat, but never enter love mode.",
				"1.18+: This block is considered to be one and a half blocks tall for animals so they won't get on it."
			]
		},
		{
			"name": "Gravisand",
			"image": "gravisand.jpg",
			"added": "1.14",
			"desc": [
				"Gravisand is a new sand variant, crafted with sand and an ender pearl.",
				"Gravisand will not fall unless primed with redstone. However, if gravisand receives a signal, and can not fall, it'll instead float up. Additionally, gravisand will propagate the signal to any adjacent gravisand blocks, causing them to fall or float as well.",
				"Gravisand allows for a variety of redstone components, especially as its magnetic properties have it constantly output a comparator signal of 15."
			]
		},
		{
			"name": "Iron Rod",
			"image": "iron-rod.jpg",
			"added": "1.14",
			"desc": [
				"Pistons pushing an Iron Rod will have it work as a drill of sorts, breaking any blocks in front in the direction the rod is facing. These can break anything the piston can push.",
				"Iron Rods are crafted with 2 Iron Ingots and an End Rod."
			]
		},
		{
			"name": "Pistons Move Tile Entities",
			"image": "pistons-move-tes.jpg",
			"added": "1.14",
			"desc": [
				"Pistons are allowed to move Tile Entities (blocks with extra data attached, like Chests or Furnaces). Attempting to move a block to an invalid position will cause it to break and drop its contents, though.",
				"For a block that pistons can't move, now that furnaces can't be used, look into Sturdy Stone in the Building category.",
				"Note that some blocks such as Monster Spawners can't be moved this way, so you don't go and break the game!"
			]
		},
		{
			"name": "New Redstone Circuits",
			"image": "new-redstone-circuits.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Two new redstone circuit components are added to the game, the Redstone Randomizer, and the Redstone Inductor:",
				"*The Randomizer is crafted the same was as a comparator, but with Biotite (from the World category, or an Eye of Ender if disabled). When given a redstone signal from the back, it'll randomly enable either the left or right output.",
				"*The Inductor is crafted made with Stone, Redstone, and Magma Cream. Its output value is the analog sum of all 3 input sides. It can also be locked by having a repeater or comparator pointing to it. While locked, it'll maintain the output value regardless of any changes."
			]
		},
		{
			"name": "Redstone Randomizer",
			"image": "redstone-randomizer.jpg",
			"added": "1.18",
			"desc": [
				"The Randomizer is a new redstone compontent and is crafted the same way as a comparator, but with Prismarine Crystals. When given a redstone signal from the back, it'll randomly enable either the left or right output."
			]
		},
		{
			"name": "Weather Sensor",
			"image": "weather-sensor.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"The Weather Sensor is crafted with Purpur Slabs, Biotite (from the World category, or Obsidian if not enabled) and Glass. It works like a Daylight Sensor, but it emits a full redstone signal if it's raining or snowing.",
				"Similarly to the Daylight Sensor, right clicking it inverts its output. Lastly, if it's raining in the world, but the biome you're in has no rain, like a desert, the sensor will only emit a signal of 7."
			]
		},	   
		{
			"name": "Obsidian Pressure Plate",
			"image": "obsidian-pressure-plate.jpg",
			"added": "1.14",
			"desc": [
				"Pressure Plates made with obsidian will only trigger when Players walk over them."
			]
		},
		{
			"name": "Metal Buttons",
			"image": "metal-buttons.jpg",
			"added": "1.14",
			"desc": [
				"Combining a Wooden Button with either an Iron Ingot or a Gold Ingot creates a button of that type.",
				"Drawing influence from Weighted Pressure Plates, Gold Buttons emit a very short pulse (2 redstone ticks), whereas Iron Buttons emit a very long pulse (5 seconds)."
			]
		},
		{
			"name": "Endermites Form Shulkers",
			"image": "endermites-form-shulkers.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Similarly to how a Silverfish can bury into stone, Endermites can now bury into Purpur. When they do so, they'll transform themselves and the block into a Shulker at that position, making Shulker Shells renewable."
			]
		},
		{
			"name": "Chains Connect Blocks",
			"image": "chains-connect-blocks.jpg",
			"added": "1.16.3",
			"desc": [
				"Chains can now connect blocks together when a piston moves them. As you can see in the image, the chain block itself doesn't have to be moved by the piston, and will attach indirectly to other moved blocks.",
				"Additionally, the sticking behaviour for chains connecting to slime blocks and other sticky sources has been changed: Chains will now only connect to them if they do so visually, which allows for some extra cool trickery."
			]
		}
	],
	"building": [
		{
			"name": "Compressed Blocks",
			"image": "compressed-blocks.jpg",
			"added": "1.14",
			"desc": [
				"A bunch of blocks can now be crafted into compressed variants.",
				"*Charcoal can be crafted into a Charcoal Block, which will burn forever.",
				"*Blaze Rods and Powder can be crafted into a Blaze Lantern. It'll also burn forever.",
				"*Leather can be crafted into Bonded Leather.",
				"*Sugar Cane, Bamboo, Cactus, Chorus Fruits, and Sticks can be made into various blocks that can be placed like a pillar.",
				"*Apples, Golden Apples, Potatoes, Carrots, and Beetroots can be crafted into Crates. Golden Apple crates will work as a beacon base.",
				"*Glow Berries (1.18+), Cocoa Beans, Sweet Berries, Nether Wart, and Gunpowder can be crafted into Sacks. If the Nether Wart Sack is enabled, the recipe for Nether Wart Blocks is changed to be 2x2."
			]
		},
		{
			"name": "Duskbound Blocks",
			"image": "duskbound-blocks.jpg",
			"added": "1.14",
			"desc": [
				"Purple looking blocks made from Purpur and Obsidian, fully featured with stair, slab and wall variants.",
				"Also includes Duskbound Lamps, made with Duskbound Blocks and Ender Pearls.",
				"1.16+ Only: Duskbound blocks and all variants are also immune to the dragon."
			]
		},
		{
			"name": "Framed Glass",
			"image": "framed-glass.jpg",
			"added": "1.14",
			"desc": [
				"Combine Iron Ingots and Glass, and you get yourself some fancy Framed Glass, great for some more rustic or medieval builds.",
				"You can also craft Panes with these, of course.",
				"1.16.4+ Only: Stained Framed Glass of all 16 colors can also be created, the same way you'd create normal Stained Glass."
			]
		},
		{
			"name": "Iron Grate",
			"image": "grate.jpg",
			"added": "1.14",
			"desc": [
				"The Iron Grate is a cool new block with multiple uses. Animals are afraid of walking on it, and will never do it, whereas items will just fall through the gaps.",
				"Players, monsters, and other entities will just walk through normally.",
				"1.16+ Only: Animals being held by a leash will also walk over the block just fine."
			]
		},
		{
			"name": "Item Frame Variants",
			"image": "item-frame-variants.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Item Frames can now be displayed in two new fancy ways:",
				"*First off, you can dye them any of the 16 colors of the minecraft rainbow.",
				"*Secondly, you can craft a Glass Item Frame. Glass Item Frames will hide the frame around the item when you put it in, so you can have a display that only shows the item.",
				"Glass Item Frames have some additional features unique to them, click on More Info to check them out!"
			],
			"expand": [
				"#Glass Item Frames",
				"*If you put a banner inside a Glass Item Frame, it'll sit flat with the wall with the pattern that's in it, allowing you to create a wallpaper of sorts.",
				"*Shields display differently in Glass Item Frames, they sit flush with the wall and look nice.",
				"*1.16.3+ Only: Glass Item Frames can attach to the front of a Sign that's placed on the floor. This will make the item show flush with the sign.",
				"*1.16.4+ Only: Combining a Glass Item Frame with Glowstone Dust creates a Glowing Glass Item Frame - it glows in the dark!.",
				"*1.16.4+ Only: Glass Item Frames can be right clicked through to open chests or other inventories.",
				"*1.16.4+ Only: When a map is placed in a Glass Item Frame, it will update in real time. Perfect for spies!"
			]
		},
		{
			"name": "Glass Item Frames",
			"image": "glass-item-frames.jpg",
			"added": "1.18",
			"desc": [
				"You can now craft a Glass Item Frame. Glass Item Frames will hide the frame around the item when you put it in, so you can have a display that only shows the item.",
				"Glass Item Frames also have some additional features unique to them, click on More Info to check them out!"
			],
			"expand": [
				"#Additional Features",
				"*If you put a banner inside a Glass Item Frame, it'll sit flat with the wall with the pattern that's in it, allowing you to create a wallpaper of sorts.",
				"*Shields display differently in Glass Item Frames, they sit flush with the wall and look nice.",
				"*Glass Item Frames can attach to the front of a Sign that's placed on the floor. This will make the item show flush with the sign.",
				"*Combining a Glass Item Frame with a Glowing Ink Sac creates a Glowing Glass Item Frame, like the vanilla one.",
				"*Glass Item Frames can be right clicked through to open chests or other inventories.",
				"*When a map is placed in a Glass Item Frame, it will update in real time. Perfect for spies!"
			]
		},
		{
			"name": "Leaf Carpet",
			"image": "leaf-carpet.jpg",
			"added": "1.14",
			"desc": [
				"Leaf Carpet can be made with all types of leaves in the same recipe as wool carpet. It can be harvested by hand and has no collision box.",
				"If Blossom Oaks (from the World category) are enabled, you can use their leaves as carpet too."
			]
		},
		{
			"name": "Lit Lamp",
			"image": "lit-lamp.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Combining a Redstone Lamp with a Redstone Torch creates a Lit Redstone lamp, that's always emitting light."
			]
		},
		{
			"name": "Midori",
			"image": "midori.jpg",
			"added": "1.14",
			"desc": [
				"Midori Blocks are a green counterpart to Purpur. These are made with Moss Paste, with the same recipes as the Purpur blocks.",
				"Moss Paste is a new item that is obtained by smelting Moss in a furnace.",
				"(Midori means \"green\" in Japanese)",
				"Note: Prior to 1.18, Moss Paste was called Cactus Paste and replaced Green Dye as the smelting output of Cactus. It was able to be crafted into Green Dye at a 1:1 rate."
			]
		},
		{
			"name": "More Brick Types",
			"image": "more-brick-types.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"New brick variants are added for a few blocks:",
				"*Sandy Bricks can be crafted with Bricks and Sand.",
				"*Snowy Bricks can be crafted with Snow.",
				"*Magma Bricks can be crafted with Magma Blocks.",
				"*Charred Nether Bricks can be crafted with Nether Bricks and a Fire Charge.",
				"*Sandstone Bricks (for all sandstone types) can be crafted with Cut Sandstone.",
				"*Blue Nether Bricks (1.16+ only) can be crafted with Nether Bricks and Warped Wart Blocks. Additionally, a similar recipe is added for Red Nether Bricks.",
				"*Warped and Twisted Blackstone Bricks (1.16.4+ only) can be crafted by combining Blackstone Bricks with the respective vine.",
				"*Additionally, all of these come in Slab, Stairs, and Wall variants."
			]
		},
		{
			"name": "More Brick Types",
			"image": "more-brick-types-1.18.jpg",
			"added": "1.18",
			"desc": [
				"New brick variants are added for a few blocks:",
				"*Sandstone Bricks (for all sandstone types) can be crafted with Cut Sandstone.",
				"*Cobblestone Bricks and their mossy variants are made just like you'd make Stone Bricks, except with Cobblestone. They can be combined with other blocks (1.16+ only) to create new color variants.",
				"*Blackstone Bricks can be crafted with Cobblestone Bricks and Blackstone.",
				"*Dirt Bricks can be crafted with Cobblestone Bricks and Dirt.",
				"*Netherrack Bricks can be crafted with Cobblestone Bricks and Netherrack.",
				"*Blue Nether Bricks can be crafted with Nether Bricks and Warped Wart Blocks. Additionally, a similar recipe is added for Red Nether Bricks.",
				"*Additionally, all of these come in Slab, Stairs, and Wall variants."
			]
		},
		{
			"name": "More Stone Variants",
			"image": "more-stone-variants.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Brick, Chiseled Brick, Pillar, and Pavement variants are available for all types of stone added by vanilla and Quark.",
				"The Brick types come in Slab, Stair, and Wall variants, and the Chiseled Brick types look different for each type of stone."
			]
		},
		{
			"name": "More Stone Variants",
			"image": "more-stone-variants-1.18.jpg",
			"added": "1.18",
			"desc": [
				"Brick, Chiseled Brick, and Pillar variants are available for all types of stone added by vanilla and Quark.",
				"The Brick types come in Slab, Stair, and Wall variants, and the Chiseled Brick types look different for each type of stone."
			]
		},
		{
			"name": "Nether Brick Fence Gate",
			"image": "nether-brick-fence-gate.jpg",
			"added": "1.14",
			"desc": [
				"A Fence Gate made of Nether Bricks. Crafted with Nether Brick blocks in the place of planks and Nether Brick Fences in the place of Sticks. The recipe outputs 2."
			]
		},
		{
			"name": "Paper Decor",
			"image": "paper-decor.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Oriental style decoration can now be made with Paper and Bamboo.",
				"*Paper Walls (\"Shoji\") come in three variants: Normal, Big, and Decorated. The latter can be crafted by adding a Sapling.",
				"*Paper Lanterns (\"Chochin\") come in Normal and Decorated variants, the latter similarly crafted with a Sapling. Try hanging or propping them with fences!"
			]
		},
		{
			"name": "Bamboo Mats",
			"image": "bamboo-mats.jpg",
			"added": "1.16",
			"removed": "1.18",
			"desc": [
				"Bamboo and Sticks can now be crafted into Bamboo Mats. These blocks can be placed in all horizontal directions, as well as vertically to create a \"box\" look."
			]
		},
		{
			"name": "Oriental Palette",
			"image": "oriental-palette.jpg",
			"added": "1.18",
			"desc": [
				"Oriental style decoration can now be made with Paper, Bamboo, and Sticks.",
				"*Paper Walls (\"Shoji\") come in three variants: Normal, Big, and Decorated. The latter can be crafted by adding a Sapling.",
				"*Paper Lanterns (\"Chochin\") come in Normal and Decorated variants, the latter similarly crafted with a Sapling. Try hanging or propping them with fences!",
				"*Bamboo Mats (\"Tatami\") are a carpet sized block, crafted using Bamboo and Sticks. They can also be crafted into a full block sized version."
			]
		},
		{
			"name": "Iron Plates",
			"image": "iron-plates.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Iron Plates can now be crafted using Iron Ingots. You can also craft Rusty Iron Plates using a Water Bucket as well."
			]
		},
		{
			"name": "Industrial Palette",
			"image": "industrial-palette.jpg",
			"added": "1.18",
			"desc": [
				"Industrial style decoration can now be made using Iron.",
				"*Iron Plates can be crafted using Iron Ingots. You can also craft Rusty Iron Plates using a Water Bucket as well. They can further be crafted into variants such as stairs and pillars.",
				"*You can also make Iron Ladders, using Iron Nuggets. They work like normal ladders, but fit the industrial style."
			]
		},
		{
			"name": "Cobblestone Bricks",
			"image": "cobblestone-bricks.jpg",
			"added": "1.15",
			"removed": "1.18",
			"desc": [
				"Cobblestone Bricks and their mossy variants are made just like you'd make Stone Bricks, except with Cobblestone. They're a fancy new way to improve your rustic stone builds.",
				"1.16+: Cobblestone Bricks can be combined with other blocks, as you can see in the image, to create new color variants."
			]
		},
		{
			"name": "Quilted Wool",
			"image": "quilted-wool.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Crafting Wool with String creates Quilted Wool. Quilted Wool comes in all colors and has a framed design."
			]
		},
		{
			"name": "Rope",
			"image": "rope.jpg",
			"added": "1.14",
			"desc": [
				"Rope Coils can be crafted using String. This new block can be placed on the bottom face of a block, by players and dispensers, and dropped down by right clicking on the placed Rope block. Shift-right clicking, or right clicking with a non-rope item will pull the rope up.",
				"If a block is at the end of the rope, it'll drop down and be pulled up alongside it. Lastly, as you'd expect, players can climb rope as if it were a ladder."
			]
		},
		{
			"name": "Shingles",
			"image": "shingles.jpg",
			"added": "1.14",
			"desc": [
				"Shingles are \"Tile\" style blocks for Terracotta and all its color variants inspired by Portuguese rooftops (\"Telha Lusa\"). They can all be turned into stairs and slabs, and look great for roofs.",
				"4 Blocks are crafted with a 2x2 of the respective Terracotta block."
			]
		},
		{
			"name": "Soul Sandstone",
			"image": "soul-sandstone.jpg",
			"added": "1.14",
			"desc": [
				"Sandstone made of Soul Sand. All recipes are as expected.",
				"Soul Sandstone can be turned into Stairs, Slabs, and Walls."
			]
		},
		{
			"name": "Stained Planks",
			"image": "stained-planks.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Dyed Wooden Planks of all 16 colors, featuring a pastel color palette so you can actually build with them without making your eyes hurt! All include stair and slab variants."
			]
		},
		{
			"name": "Sturdy Stone",
			"image": "sturdy-stone.jpg",
			"added": "1.14",
			"desc": [
				"A hard stone block made with 4 Stone and 4 Cobblestone (outputs 4). The block has the Furnace Texture, and can not be moved by Pistons."
			]
		},
		{
			"name": "Tallow And Candles",
			"image": "tallow-and-candles.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"In an attempt to make pigs be useful in any way, they drop Tallow. Tallow can be crafted alongside String to create Candles, or as a furnace fuel.",
				"Candles come in all 16 colors of the spectrum, and emit as much light as torches. Candles will also fall like sand if there's no block under them, which can have many fun uses.",
				"1.16+ Only: Lastly, for Enchanting Table purposes, a candle equals one bookshelf."
			]
		},
		{
			"name": "Thatch",
			"image": "thatch.jpg",
			"added": "1.14",
			"desc": [
				"Thatch is created via a 2x2 of Wheat. It can be used for stairs and slabs or turned back into 4 Wheat. You can use it for some fancy medieval roof styles."
			]
		},
		{
			"name": "Turf",
			"image": "turf.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Turf Blocks can be crafted using a few bits of Tall Grass.",
				"These blocks have the grass texture and coloring on all sides, are available in stair and slab variants, and do not decay when a block is on top.",
				"1.16+: Turf and Turf variants can hold any plants grass can, including Sugar Cane without nearby water if a Turf stair/slab is waterlogged."
			]
		},
		{
			"name": "Variant Bookshelves",
			"image": "variant-bookshelves.jpg",
			"added": "1.14",
			"desc": [
				"You can now make Bookshelves out of all wood types. All of these bookshelves work for the Enchanting Table too."
			]
		},
		{
			"name": "Variant Chests",
			"image": "variant-chests.jpg",
			"added": "1.14",
			"desc": [
				"Chests can be made of all the different wood types. Each one is styled differently for the type of wood you use.",
				"To get the vanilla chest, you can craft a chest with more than one type of wood, or woods added by other mods.",
				"1.16.3+ Only: These variant chests will also replace the chests found in structures in the world.",
				"1.16.4+ Only: Variant Chests can be converted into Vanilla Chests by placing them in a crafting table."
			]
		},
		{
			"name": "Variant Ladders",
			"image": "variant-ladders.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Ladders can be made of all the different wood types. To compensate for the fact that sticks do not come in different wood types, the recipe for ladders is changed to have a single plank of the corresponding wood type in the center.",
				"You can also make Iron Ladders, using Iron Ingots. They work like normal ladders, except that they can stand by themselves as long as there is an Iron Ladder on top, even if there isn't a block behind."
			]
		},
		{
			"name": "Variant Ladders",
			"image": "variant-ladders-1.18.jpg",
			"added": "1.18",
			"desc": [
				"Ladders can be made of all the different wood types. To compensate for the fact that sticks do not come in different wood types, the recipe for ladders is changed to have a single plank of the corresponding wood type in the center."
			]
		},
		{
			"name": "Vertical Planks",
			"image": "vertical-planks.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Putting 3 wooden planks in a vertical line creates 3 Vertical Wooden Planks. Doing the same reverts it.",
				"If Stained Wooden Planks is enabled, vertical versions of those are also added."
			]
		},
		{
			"name": "Vertical Slabs",
			"image": "vertical-slabs.jpg",
			"added": "1.14",
			"desc": [
				"Do I have to explain this?",
				"They exist for every vanilla and Quark block that has a slab, and can be crafted by placing 3 of the respective slab in a column."
			]
		},
		{
			"name": "More Potted Plants",
			"image": "more-potted-plants.jpg",
			"added": "1.14",
			"desc": [
				"17 new blocks can now be added to Flower Pots. The feature image shows a bunch, but you can also add the vanilla 2 tall flowers, and nether wart.",
				"1.16.3+: Twisted vines, warped vines, large ferns, tall grass, vines, and nether sprouts are also added."
			]
		},
		{
			"name": "Gold Bars",
			"image": "gold-bars.jpg",
			"added": "1.15",
			"desc": [
				"Gold Bars are just like Iron Bars, but with gold! They look great for nether builds."
			]
		},
		{
			"name": "Shallow Dirt",
			"image": "shallow-dirt.jpg",
			"added": "1.16",
			"removed": "1.18",
			"desc": [
				"Right clicking with a Hoe on a Path block creates a new Shallow Dirt block. This block has the same texture as dirt, and is 14 pixels high, as opposed to Path, which is 15 pixels high.",
				"Additionally, and perhaps more importantly, Shallow Dirt can be waterlogged, to create a cool puddle effect, as you can see in the image."
			]
		},
		{
			"name": "Tie Leads to Fences",
			"image": "tie-leads-to-fences.jpg",
			"added": "1.16",
			"removed": "1.18",
			"desc": [
				"Leads can now be tied directly between two fences, rather than only fence-animal.",
				"Additionally, if Paper Lanterns are enabled, you can also right click on one first, and then a fence, to tie the lantern to the fence."
			]
		},
		{
			"name": "Burn Vine Tips",
			"image": "burn-vine-tips.jpg",
			"added": "1.16.3",
			"removed": "1.18",
			"desc": [
				"The tip of a vine can now be burnt with a Flint and Steel. When you do so, the vine will no longer be able to grow."
			]
		},
		{
			"name": "Shear Vine Tips",
			"image": "shear-vine-tips.jpg",
			"added": "1.18",
			"desc": [
				"The tip of a vine can now be right clicked with Shears. When you do so, the vine will no longer be able to grow."
			]
		},
		{
			"name": "Wooden Posts",
			"image": "wooden-posts.jpg",
			"added": "1.16.3",
			"desc": [
				"Wooden Posts can be crafted with Logs or Stripped Logs. These are slim log style blocks you can lay down vertically or horizontally. Chains and lanterns can also connect to them."
			]
		},
		{
			"name": "Hedges",
			"image": "hedges.jpg",
			"added": "1.16.4",
			"desc": [
				"Hedges can be crafted using an overworld log and the respective leaf type. They connect to each other like fences, and have the same bounding box. You can even put flowers on them!"
			]
		},
		{
			"name": "Stools",
			"image": "stools.jpg",
			"added": "1.16.4",
			"desc": [
				"Stools can be created the same way you'd make a Bed, but using slabs instead of full wood blocks. As you can expect, you can sit on them!",
				"Additional stool features include being able to place blocks over them, which makes them get bigger to match, and being able to stay on them even when moved by pistons."
			]
		},
		{
			"name": "Celebratory Lamps",
			"image": "celebratory-lamps.jpg",
			"added": "1.16.4",
			"desc": [
				"New Lamp blocks can be crafted with your block of choice, glass, and a torch. They come in Stone and Stone Brick variants, and emit a light level of 15.",
				"These blocks are a celebration of Vazkii's Mods' 10th Anniversary, from 2011 through 2021, starting with the Lamps mod. Check out the <a href='https://vazkii.net/archive/mcf/'>Archive!</a>"
			]
		},
		{
			"name": "Variant Furnaces",
			"image": "variant-furnaces.jpg",
			"added": "1.18",
			"desc": [
				"Furnaces crafted from Deepslate or Blackstone have new textures. Additionally, Blackstone Furnaces can emit soul fire particles if placed over a black that can light up with soul fire.",
				"Otherwise, they both behave the same as normal Furances."
			]
		}
	],
	"client": [
		{
			"name": "Chest Searching",			
			"image": "chest-searching.jpg",
			"added": "1.14",
			"desc": [
				"A filter button will now appear on the top right of chests you open. When you click it, a tab with a search bar will pop up, where you can type and filter items in the chest by your query. Items that don't match will be darkened.",
				"You can also search for enchantment and potion names, or wrap the search in quotes to match entire names."
			]
		},
		{
			"name": "Greener Grass",
			"image": "greener-grass.jpg",
			"added": "1.14",
			"desc": [
				"Grass is greener on the Quark side. Biome colors are still respected, but are greener non the less.", 
				"There's also config options to enable Alpha style grass, which gives you the Minecraft Alpha vibe, or to manually set the grass color.",
				"You can also manually adjust the color balance in the config menu."
			],
			"expand": [
				"#Greener Grass Config Menu",
				"!img/features/client/greener-grass/greener-gui.png"
			]
		},
		{
			"name": "Improved Mount HUD",
			"image": "improved-mount-hud.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"While on a mount, your food display is still shown. Furthermore, while on a horse, the jump bar is only shown while holding down the jump key, the XP bar is shown otherwise."
			]
		},
		{
			"name": "Improved Tooltips",
			"image": "improved-tooltips.jpg",
			"added": "1.14",
			"desc": [
				"A few tooltips are changed around the place with visual elements:",
				"*Tools and armor have their attributes displayed with icons.",
				"*Food shows how much it'll heal with icons, and will show when it'll give you negative effects.",
				"*Shulker Boxes show their contents visually.",
				"*Maps display in the tooltip.",
				"*Enchanted Books show which items they can be applied to."
			],
			"expand": [
				"#Tools and Armor",
				"!img/features/client/improved-tooltips/attributes.jpg",
				"#Food",
				"!img/features/client/improved-tooltips/food.jpg",
				"#Shulker Boxes",
				"!img/features/client/improved-tooltips/shulker.jpg",
				"#Maps",
				"!img/features/client/improved-tooltips/map.jpg",
				"#Enchanted Books",
				"!img/features/client/improved-tooltips/books.jpg"
			]
		},
		{
			"name": "Usage Ticker",
			"image": "usage-ticker.jpg",
			"added": "1.14",
			"desc": [
				"A small interface addition shows up next to the hotbar when items are used, or armor takes damage. This shows how many items or blocks you have left, or how the status of your armor is."
			]
		},
		{
			"name": "Variant Animal Textures",
			"image": "variant-animal-textures.jpg",
			"added": "1.14",
			"desc": [
				"Cows, Pigs, and Chicken will now have randomized textures from a small pool of variants. Additionally, some animals may rarely show up with a special variant..."
			],
			"expand": [
				"Here's a render with the new skins for your enjoyment:",
				"!img/features/client/variant-animal-textures/render.png"
			]
		},
		{
			"name": "Mouse 4 as Back",
			"image": "back-keybind.jpg",
			"added": "1.14",
			"desc": [
				"Pressing Mouse 4 (by default, rebindable) will try to find a Back/Done/Cancel button in your current GUI and click it. This makes the button work as a \"Back\" button like in most programs."
			]
		},
		{
			"name": "Camera Mode",
			"image": "camera.jpg",
			"added": "1.15",
			"desc": [
				"Pressing F12 (by default, rebindable) will open Camera Mode.",
				"In this new mode, you can take enhanced screenshots, by using over 20 image filters, and combining them with borders and overlays. You can even enable grid lines such as the Rule of Thirds or the Golden Ratio to help you take a perfect image!"
			]
		},
		{
			"name": "Auto Walk Keybind",
			"image": "auto-walk-1.18.jpg",
			"added": "1.16.3",
			"desc": [
				"Pressing the rebindable key (unbound by default, Caps Lock prior to 1.18) will toggle Auto Walk until either you press it again or start walking manually. While in Auto Walk, Auto Jump is also enabled. Great for people with motor problems who can't hold down a button for too long!"
			]
		},
		{
			"name": "Microcrafting Helper",
			"image": "microcrafting-helper.jpg",
			"added": "1.18",
            "desc": [
                "A crafting queue system is added to help when crafting recipes involving multiple steps:",
                "*If you try to craft an item using the recipe book but don't have all necessary ingredients, you can now right click the created \"ghost items\" to instead bring up the recipe for that item.",
                "*The item you were previously trying to craft will now be put in a \"crafting queue\" which shows up above the crafting result",
                "*Upon crafting the current item, the previous item in the queue is loaded again",
                "<a href='https://streamable.com/2k512k'>Here</a> is a demo video to better demonstrate this feature."
            ]
		}
	],
	"management": [
		{
			"name": "Chests In Boats",
			"image": "chests-in-boats.jpg",
			"added": "1.14",
			"desc": [
				"Right clicking a Chest onto a Boat adds the chest in as a passenger. To access the chest, simply enter the boat and open your inventory, just like you would for a horse. To remove the chest (and the items inside), break the boat."
			]
		},
		{
			"name": "Easy Transfering",
			"image": "easy-transfering.jpg",
			"added": "1.14",
			"desc": [
				"Two new buttons are added to chests: Insert, and Extract.",
				"*The Insert button will try to put every item in your inventory (not hotbar) inside the chest.",
				"*The Extract button will try to pull every item from the chest into your inventory.",
				"If you hold Shift while pressing these buttons, they'll only move items that are on the other side. (For example, if your chest has Stone and Dirt, and you have Stone and Sand in your inventory, Insert with Shift held will only move the Stone)",
				"1.16.4+: A new button is also added that locks your Shift button down as a toggle. Useful for people with muscle problems!"
			]
		},
		{
			"name": "F To Switch",
			"image": "f-to-switch.jpg",
			"added": "1.14",
			"removed": "1.16",
			"desc": [
				"Pressing F on an item in the inventory swaps it with your off-hand item, just as if you'd pressed F outside of the inventory. This uses the same keybind used for that purpose."
			]
		},
		{
			"name": "Hotbar Changer",
			"image": "hotbar-changer.jpg",
			"added": "1.14",
			"desc": [
				"Pressing the Z key (rebindable) will show your entire inventory above your hotbar. You can then press 1, 2, or 3, to switch that respective inventory row with your hotbar. Pressing Z again will hide the 3 additional rows with no change."
			]
		},
		{
			"name": "Inventory Sorting",
			"image": "inventory-sorting.jpg",
			"added": "1.14",
			"desc": [
				"A \"Sort\" button is added to the inventory screen and Chests. Pressing this button sorts your inventory, excepting your hotbar.",
				"Sorting is done via a category system, in which items are placed based on what category they fit in (food, tool, armor, block, etc.). Each category also has its own sorting rules, e.g. food will get sorted based on which is more filling; tools will get sorted based on which one is the best, or has more durability."
			]
		},
		{
			"name": "Shulker Box Right Click",
			"image": "shulker-box-right-click.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"While holding an item in your cursor (that isn't a Shulker Box), you can right click on top of a non-full Shulker Box to add the item to it."
			]
		},
		{
			"name": "Expanded Item Interactions",
			"image": "expanded-item-interactions.jpg",
			"added": "1.18",
			"desc": [
				"A few new ways to interact with the items in your inventory have been added.",
				"*While holding an item in your cursor (that isn't a Shulker Box), you can right click on top of a non-full Shulker Box to add the item to it. Alternatively, you can also right click the shulker box on the item.",
				"*Right clicking an armor item in an inventory will swap it for whatever armor you're currently holding.",
				"*Items can now be right clicked onto a Lava Bucket to destroy them forever. Shulker Boxes and items that are immune to fire (eg. Netherite) can not be destroyed this way."
			]
		},
		{
			"name": "Item Sharing",
			"image": "item-sharing.jpg",
			"added": "1.14",
            "desc": [
                "Pressing Shift+T (or whatever your Chat key is set to) while looking at an item in an inventory links that item to chat. Other players can hover over it to check it out."
            ]
		},
		{
			"name": "Right Click Armor",
			"image": "right-click-armor.jpg",
			"added": "1.16.3",
			"removed": "1.18",
            "desc": [
                "Right clicking an armor item in an inventory will swap it for whatever armor you're currently holding."
            ]
		}
	],
	"mobs": [
		{
			"name": "Foxhounds",
			"image": "foxhounds.jpg",
			"added": "1.14",
            "desc": [
                "Foxhounds are new hostile mobs that spawn in the Nether. These fierce doggos will attack you and set you on fire.",
                "If you're brave enough, drink a fire resistance potion and feed them some Coal to tame them. Tamed Foxhounds work just like regular wolves, but with a few extra tidbits:",
                "*They'll sleep on hot blocks like magma.",
                "*If put on top of a furnace, they'll make the furnace faster. You can't put multiple doggos on a furnace to speed it up more, though.",
                "*1.16+: If one would spawn in a Soul Sand Valley, you'll get one with blue soul fire particles and a blue texture."
            ]
		},
		{
			"name": "Stonelings",
			"image": "stonelings.jpg",
			"added": "1.14",
            "desc": [
                "Stonelings are new passive mobs that spawn in the deep underground and in complete darkness. These little stone fairies will spawn in carrying an item, and will get startled if you get too close to them without sneaking. Once startled, they'll run away from you and eventually poof out of existence. If you manage to kill one, you'll get the item its carrying.",
                "Additionally, Stonelings drop a Heart of Diamond, a new item which you can use on any stone block to create your own tamed Stoneling! Tamed Stonelings can hold items you give them, eat Stone (they love it!), and follow you if you hold a Diamond.",
                "Note: Prior to 1.18, Stonelings did not always drop a Heart of Diamond and did not require complete darkness to spawn."
            ]
		},
		{
			"name": "Crabs",
			"image": "crabs.jpg",
			"added": "1.14",
			"desc": [
				"Crabs are cute new animals that spawn in beaches. They walk sideways and will prick you if you get too close! If you kill one, they might drop Crab Legs or Crab Shells.",
				"*Crab Legs can be cooked and eaten, they're quite tasty!",
				"*Crab Shells can be brewed into a Potion of Resilience. While under its effect, you'll gain additional knockback resistance.",
				"*Crabs can be bred with Wheat, Chicken, or any type of Fish.",
				"*They are also known to enjoy music, or so we've been told."
			]
		},
		{
			"name": "Frogs",
			"image": "frogs.jpg",
			"added": "1.14",
			"desc": [
				"These wednesday loving critters will spawn in swamps, they jump and croak around, and look very derpy. If you kill one, you'll get some Frog Legs.",
				"*Frog Legs can be cooked and eaten, or made golden to brew into a Potion of Leaping.",
				"*Frogs are known to come in a variety of sizes, which can be passed down to their children. I wonder what you could do with that.",
				"*Frogs can be bred with Spider Eyes or any type of Fish."
			]
		},
		{
			"name": "Toretoises",
			"image": "toretoises.jpg",
			"added": "1.15",
            "desc": [
                "Toretoises are new neutral mobs that will spawn deep underground and in complete darkness. When a Toretoise spawns, it'll come with a random type of ore (Coal, Iron, Lapis, or Redstone). You may attack the Toretoise with a pickaxe to have it drop that ore!",
           		"If you hit a Toretoise without a pickaxe, or when it has no ore, it'll emit a shockwave attack. This will damage any non-Toretoise entities around, and redirect their aggro to you.",
           		"With enough care, it's possible to carry a Toretoise home and feed it so it grows more ores, feel free to click More Info for some tips on how to do it."
            ],
            "expand": [
            	"If you want to take these huge creatures home and use them to generate ores, there's some things you should know.",
            	"*Feeding the Toretoise Glow Berries will sometimes have it regenerate its ores.",
            	"*The Toretoise will regenerate a random ore each time.",
            	"*If the Feeding Trough (from the Automation module) is enabled, the Toretoise will eat from it.",
            	"*Toretoises do not breed. They do spawn like hostile mobs, so you can go back for more.",
            	"*When a Toretoise generates ore, it will enter an eating cooldown for 1 minute.",
            	"*Toretoises will sink in water, and are immune to drowning, fall, and fire damage.",
            	"*Toretoises are 1 block tall, but grow to 1.4 blocks tall if they have an ore.",
            	"*Toretoises move very slowly, and can't be leashed, using Minecarts is recommended.",
            	"*If Iron Rods (from the Automation module) are enabled, pushing them onto a Toretoise with a piston will break its ore.",
            	"Note: Prior to 1.18, Toretoises were fed with Cave Roots (from the World module) instead (or Cactus if disabled). They also did not require complete darkness to spawn."
            ]
		},
		{
			"name": "Wraiths",
			"image": "wraiths.jpg",
			"added": "1.16.4",
            "desc": [
                "Wraiths are new aggressive mobs that spawn in the Soul Sand Valley. They're the lost souls of different mobs, and as such, their sounds are low pitch versions of normal mob sounds.",
                "They attack like a normal Zombie, inflict slowness, and jump back upon dealing damage. Upon death, they'll drop a Soul Bead.",
                "Right clicking the Soul Bead will release the soul trapped within, which will fly in the direction of the nearest Nether Fortress."
            ]
        },
		{
			"name": "Forgotten",
			"image": "forgotten.jpg",
			"added": "1.16.4",
            "desc": [
                "Forgotten are new rare skeleton variants that spawn deep underground and in complete darkness, randomly replacing normal skeleton spawns. These are forgotten hosts of old explorers, making them apt at combat with both a bow and a sword, which always come randomly enchanted.",
                "Their bows are tipped with Blindness arrows, and when you're blinded, they'll charge at you with their sword, switching back to the bow once the effect ends. On death, they'll drop their hat.",
                "Wearing an Explorer's Hat, aside from making you look super fashionable, increases your maximum reach distance by 2 blocks, and also improves your luck while fishing.",
                "Note: Prior to 1.18, Forgotten did not require complete darkness to spawn."
            ]
        },
        {
			"name": "Shiba",
			"image": "shiba.jpg",
			"added": "1.18",
            "desc": [
                "The Shiba is a new friendly dog that spawns in mountain biomes. They can be tamed and interacted with in the same way as a wolf but will in addition also fetch any arrows or tridents after they land and bring them back to you, as long as they are not sitting.",
                "If you are holding a torch, they will also look for dark spots and get mad at them so you know where to light up next.",
                "They'll also lay down if you're having them sit on a bed!"
            ]
        }
	],
	"tools": [
		{
			"name": "Abacus",
			"image": "abacus.jpg",
			"added": "1.16.4",
			"desc": [
				"Right clicking a block will bind the Abacus to it. After that, it will count the distance between the targeted and hovered block, measured along right angles.",
				"The Abacus will count up to 48 blocks, drawing an outline of the counted blocks. The texture of the item will change according to how many blocks are counted. Right click again to unbind."
			]
		},
		{
			"name": "Ambience Discs",
			"image": "ambience-discs.jpg",
			"added": "1.16.4",
			"desc": [
				"A variety of 8 discs that add a wide range of ambient sound to the game. When you insert them into a Jukebox, they loop infinitely, and do not display on the UI when played.",
				"The following sounds are available: Water Droplets, Ocean Waves, Rainy Mood, Heavy Wind, Soothing Cinders, Tick-Tock, Cricket Song, and Packed Venue.",
				"Ambience Discs are acquired when a Skeleton kills a Spider."
			]
		},
		{
			"name": "Ancient Tomes",
			"image": "ancient-tomes.jpg",
			"added": "1.14",
			"desc": [
				"Ancient Tomes are a rare loot item from dungeons and stronghold libraries, being usable to upgrade enchantments.",
				"1.16.5+: Combining an Ancient Tome in an Anvil with an item containing that enchantment will increase its level by one, up to one over the cap (e.g. Looting IV).",
				"Pre 1.16.5: They come only in the highest level of an enchantment and can be combined with an Enchanted Book of the same enchantment to create one that's a level higher than the max. This costs 35 levels to create the book and an extra 35 to apply it."
			]
		},
		{
			"name": "Pathfinder Maps",
			"image": "pathfinder-maps.jpg",
			"added": "1.14",
			"desc": [
				"Cartographer Villagers will now sell Pathfinder Maps, new maps that will take you to certain biomes. Each Cartographer will stock a random assortment of them, and the possible trades are as follows by default:",
				"*Apprentice (Expert in 1.16+): Snowy Plains Map, Windswept Hills, Dark Forest, Desert, Savanna",
				"*Journeyman (Master in 1.16+): Swamp, Old Growth Pine Taiga, Flower Forest",
				"*Expert: Jungle, Bamboo Jungle, Badlands",
				"*Master: Mushroom Fields, Ice Spikes",
				"If you're using mods that add more biomes, more maps can be added in the config file.",
				"Note: Prior to 1.18, Snowy Plains Map, Windswept Hills Map, and Old Growth Pine Taiga Map were replaced by Snowy Tundra Map, Mountains Map, and Giant Tree Taiga Map, respectively."
			]
		},
		{
			"name": "Pickarang",
			"image": "pickarang.jpg",
			"added": "1.14",
			"desc": [
				"A new tool for mining! The pickarang is a boomerang pickaxe - throw it, it breaks whatever it hits, and comes back to you with the drops.",
				"The Pickarang is crafted with a Heart of Diamond (from Stonelings, in the Mobs category, or just diamonds if it's disabled), and can be enchanted with Efficiency, Unbreaking, Fortune, Silk Touch, and Piercing."
			]
		},
		{
			"name": "Slime Bucket",
			"image": "slime-bucket.jpg",
			"added": "1.14",
			"desc": [
				"Right clicking a tiny slime with a bucket puts it in there. It remains quiet, but will start jumping inside the bucket if you find yourself in a slime chunk.",
				"The slime can also be deployed back into the world by right clicking on a block. You can also use it as a replacement for slimeballs. You monster."
			]
		},
		{
			"name": "Trowel",
			"image": "trowel.jpg",
			"added": "1.14",
			"desc": [
				"A Trowel tool can be crafted with Iron and Sticks. The Trowel, when right clicked, will place a random block from your hotbar, making it useful for ruins or paths.",
				"Prior to 1.16.4, a Trowel will break after placing 256 blocks, or four stacks."
			]
		},
		{
			"name": "Colored Runes",
			"image": "colored-runes.jpg",
			"added": "1.14",
            "desc": [
                "Colored Runes are a rare loot item from dungeons, temples and nether fortresses. They can be applied to enchanted items and lodestone compasses in an anvil, in order to change the color of the enchantment glint from purple to the color of the rune. These come in all 16 colors of the spectrum.",
                "If you're dedicated enough, you can craft a Rainbow Rune by mixing together the runes that make the colors of the rainbow. It'll change color over time and look really cool!",
				"1.16.4+ Only: Colored Runes will no longer spawn in chests. Instead, you'll find Blank Runes. Click More Info to find out more."
            ],
			"expand": [				
				"Blank Runes are found as dungeon loot.",
				"!img/features/tools/colored-runes/generated-rune.png",
				"Blank Runes can be combined with any dye to create a rune of your choice.",
				"!img/features/tools/colored-runes/dyeable-runes.jpg",
				"Blank Runes can be used without dyeing to remove the enchantment glint.",
				"Additionally in 1.16.4, the cost to apply a rune to an item was reduced from 15 to 5."
		   	]
		},
		{
			"name": "Bottled Cloud",
			"image": "bottled-cloud.jpg",
			"added": "1.15",
            "desc": [
                "Using a Glass Bottle at the cloud levels (192-196 by default) will get you a Bottled Cloud.",
                "The Bottled Cloud can be right clicked to produce a (non-solid) block floating in midair in front of you. The cloud block disappears after a few seconds, but you can right click it with any other block to replace the two. The cloud will go back in the bottle when you do this.",
            	"Note: Prior to 1.18, the blocks produced by the Bottled Cloud were solid and the cloud levels were different (126-132 by default)."
            ]
		},
		{
			"name": "Seed Pouch",
			"image": "seed-pouch.jpg",
			"added": "1.16.3",
            "desc": [
                "The Seed Pouch is a new utility item that can store up to 10 stacks of any type of seed in it. To add seeds to the seed pouch, grab the seed you want to add in your inventory, and right click it onto the pouch. Alternatively, you can also right click the pouch onto the items you want to add (1.18+ only). You can then right click the pouch to take a stack of seeds out.",
                "There's also a small set of utility features included:",
                "*Right clicking the pouch onto farmable soil will plant the seed. Shift-right clicking plants a 3x3.",
                "*Holding the seed pouch in either hand will have picked up seeds of that type go directly in the bag.",
                "*If the Usage Ticker feature is enabled, it'll show how many seeds you have left."
            ]
		},
		{
			"name": "Skull Pikes",
			"image": "skull-pikes.jpg",
			"added": "1.16.3",
            "desc": [
                "Setting a Skeleton Skull, Zombie Head, or Creeper Head over a fence, as shown in the image, will create a skull pike. Nearby monsters in a 5 block range and with line of sight will notice it, and run away in cowardice.",
                "Note that bosses and raiders are slightly more astute, and won't fall for your tricks. Additionally, everyone knows Wither Skeletons drop their heads all the time, and Dragon Heads are all cheap fakes, so those won't work either."
            ]
		},
		{
			"name": "Bundle Recipe",
			"image": "bundle-recipe.jpg",
			"added": "1.18",
            "desc": [
            	"Bundles are now craftable with the same recipe that was to be introduced to vanilla."
            ]
		},
		{
			"name": "Beacon Redirection",
			"image": "beam-redirection.jpg",
			"added": "1.18",
            "desc": [
				"The Cluster variants of Corundum (from the World module) can be used to redirect beacon beams and change their color. If Corundum is disabled, Amethyst can be used instead.",
				"Note that for a beacon to function, the final segment must always face upwards towards the sky."
			]
		}
	],
	"tweaks": [
		{
			"name": "Armed Armor Stands",
			"image": "armed-armor-stands.jpg",
			"added": "1.14",
			"desc": [
				"Armor Stands placed by the Armor Stand item will have arms, you may also give them items. This isn't a thing by default in Java edition for some reason."
			]
		},
		{
			"name": "Automatic Recipe Unlock",
			"image": "automatic-recipe-unlock.jpg",
			"added": "1.14",
			"desc": [
				"Every single recipe is unlocked and displayed in the recipe book as soon as you load a world.",
				"If new recipes are added to the game via new mods added or updated, those will be unlocked when you get back in.",
				"This feature is an exception to the general quark theme, but since you are using mods, it's fair to assume you don't need the game to spoon-feed you recipes."
			]
		},
		{
			"name": "Axe Leaf Harvesting",
			"image": "axe-leaf-harvesting.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Axes will break leaves as fast as Shears, but will not drop the leaf blocks. Normal drops such as saplings or apples will still drop."
			]
		},
				{
			"name": "Better Elytra Rockets",
			"image": "better-elytra-rockets.jpg",
			"added": "1.16.4",
			"desc": [
				"Firework Rockets are able to be used to start Elytra flying, even if you're not currently in that state.",
				"All you have to do is right click a Firework Rocket while wearing an Elytra, and you'll shoot up into the sky."
			]
		},
		{
			"name": "Dirt To Path",
			"image": "dirt-to-path.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Right clicking dirt with a shovel will turn it into a path block, as everyone in the world hates having to wait for it to grow into grass first."
			]
		},
		{
			"name": "Double Door Opening",
			"image": "double-door-opening.jpg",
			"added": "1.14",
			"desc": [
				"Double doors open together when right clicked. Finally!"
			]
		},
		{
			"name": "Dragon Scales",
			"image": "dragon-scales.jpg",
			"added": "1.14",
			"desc": [
				"When an Enderdragon that was spawned by the player (the natural spawned one does not count!) is killed, it will drop a Dragon Scale.",
				"The scale can be combined with an Elytra to mold it, creating a new one. The old Elytra stays behind untouched."
			]
		},
		{
			"name": "Enhanced Ladders",
			"image": "enhanced-ladders.jpg",
			"added": "1.14",
			"desc": [
				"Ladders are slightly tweaked to improve your laddering experience:",
				"*Right clicking a ladder with another one will place it, allowing you to drop ladders down without risking falling to your death.",
				"*When on a ladder, looking down will make you slide down the ladder very quickly.",
				"*1.18+: Every ladder type now has the Iron Ladder behavior (they can freestand as long as there's a ladder above)."
			]
		},
		{
			"name": "Glass Shards",
			"image": "glass-shards.jpg",
			"added": "1.14",
			"desc": [
				"Glass now drops shards, crafting them in a 2x2 creates a Glass block back. The shards act like Glowstone Dust, in which Fortune will let you get more, and Silk Touch will just drop the block.",
				"Stained Glass will naturally drop shards of the respective type. If you decide to mix multiple types of stained shards, you'll end up with a new block - Dirty Glass."
			]
		},
		{
			"name": "Hoe Harvesting",
			"image": "hoe-harvesting.jpg",
			"added": "1.14",
			"desc": [
				"Breaking grass or crops with a hoe will break a 3x3 of them. A Diamond Hoe will break a 5x5 instead. If you put Fortune on the hoe, it'll also apply that effect to everything it breaks."
			]
		},
		{
			"name": "Improved Sleeping",
			"image": "improved-sleeping.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Some tweaks are made to sleeping in multiplayer to improve the experience:",
				"*If a player does not input any keystrokes or mouse clicks in interfaces for 2 minutes, they'll be marked as AFK. AFK players do not count towards the sleep vote.",
				"*When a player enters a bed, that action and the amount of players sleeping is broadcast to the server. Hovering over the count will show which players are sleeping and which aren't yet.",
				"*The percentage of players required for the day to turn over can be configured, defaulting to 100%."
			]
		},
		{
			"name": "Jukebox Automation",
			"image": "jukebox-automation.jpg",
			"added": "1.16.4",
			"desc": [
				"Dispensers are now able to place discs into Jukeboxes.",
				"This includes ambience discs."
			]
		},
		{
			"name": "Lock Rotation",
			"image": "lock-rotation.jpg",
			"added": "1.14",
			"desc": [
				"Pressing the K key (rebindable) will lock a rotation, and optionally a block half, if you're looking at a block. Any further blocks placed are changed to that direction, regardless of how you were facing when placing them. This can be very useful for building with blocks that have awkward rotation methods, such as stairs or pistons.",
				"To unlock the rotation press the key again while looking in the same direction you locked in."
			]
		},
		{
			"name": "More Banner Layers",
			"image": "more-banner-layers.jpg",
			"added": "1.16.4",
			"desc": [
				"The Loom is now able to handle 16 different patterns at once, increased from 6.",
				"This is matching the creative limit."
			]
		},
		{
			"name": "Note Block Mob Sounds",
			"image": "note-block-mob-sounds.jpg",
			"added": "1.14",
			"desc": [
				"Note Blocks with heads attached to their side will emit the respective mob's sound instead of a note.",
				"The mob sound's pitch is based on the note block pitch."
			]
		},
		{
			"name": "Pat The Dogs",
			"image": "pat-the-dogs.jpg",
			"added": "1.14",
			"desc": [
				"You can pat the dogs. Sneak-click them with an empty hand to perform this glorious act."
			]
		},
		{
			"name": "Poison Potato Usage",
			"image": "poison-potato-usage.jpg",
			"added": "1.14",
			"desc": [
				"Feeding a baby animal a Poisonous Potato has a chance to poison it for a few seconds. A baby animal that has been poisoned by this method will never grow into an adult."
			]
		},
		{
			"name": "Reacharound Placing",
			"image": "reacharound-placing.jpg",
			"added": "1.14",
			"desc": [
				"Reacharound Placing allows you to place blocks behind the block you're looking at. This can be done either vertically or horizontally, provided you wouldn't be placing a block given normal rules.",
				"*To do it vertically, sneak on the edge of a block and look at the area directly below it This is what the image is demonstrating. A [  ] will appear around your crosshair if you do it properly.",
				"*To do it horizontally (1.15+ only), look in front of a block, where the next block would be. A <  > will appear around your crosshair for this one."
			]
		},
		{
			"name": "Sign Editing",
			"image": "sign-editing.jpg",
			"added": "1.14",
			"desc": [
				"Right clicking a sign now lets you edit it even after it's been placed."
			]
		},
		{
			"name": "Simple Harvest",
			"image": "simple-harvest.jpg",
			"added": "1.14",
			"desc": [
				"Right clicking a crop will harvest it and replant it. If you have Hoe Harvesting enabled, you can also harvest a large area at once."
			]
		},
		{
			"name": "Snow Golem Player Heads",
			"image": "snow-golem-player-heads.jpg",
			"added": "1.14",
			"desc": [
				"Named Snow Golems equipped with a Pumpkin will drop a player head with the same name as theirs, if killed by a Witch.",
				"Protip: You can head over to <a href='https://minecraft-heads.com/player-heads'>Minecraft Heads</a> to find some cool ones you can use with the names!"
			]
		},
		{
			"name": "Springy Slime",
			"image": "springy-slime.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Slime Blocks will now bounce entities that hit them from the side rather than just the top. Furthermore, items will also bounce on them."
			]
		},
		{
			"name": "Utility Recipes",
			"image": "utility-recipes.jpg",
			"added": "1.14",
			"desc": [
				"A large assortment of new utility recipes are added to the game, as well as a few tweaks that help crafting in general.",
				"In order to avoid clogging up the page, please click on More Info to expand all that this feature adds."
			],
			"expand": [				
				"8 Logs can be crafted directly into 4 chests.",
				"!img/features/tweaks/utility-recipes/log-to-chest.jpg",
				"Wool of any color can be dyed.",
				"!img/features/tweaks/utility-recipes/wool.jpg",
				"Stone tools can be crafted with any type of stone.",
				"!img/features/tweaks/utility-recipes/stone-tools.jpg",
				"Dispensers, repeaters, and minecarts get recipes that combine both steps of crafting into one.",
				"!img/features/tweaks/utility-recipes/dispenser.jpg",
				"!img/features/tweaks/utility-recipes/repeater.jpg",
				"!img/features/tweaks/utility-recipes/minecarts.jpg",
				"Coral can be crafted into the respective dyes.",
				"!img/features/tweaks/utility-recipes/coral-to-dye.jpg",
				"Cookies, Paper, and Bread can be crafted in a 2x2 crafting grid as a \"bent\" recipe.",
				"!img/features/tweaks/utility-recipes/bent-paper.jpg",
				"#Additional Tweaks",
				"*Dragon Breath, when brewed, consumes the bottle so it doesn't gum up the system.",
				"*Torches can be used as fuel in furnace, smelting two items each.",
				"*Rotten Flesh and Poisonous Potatoes can be used in the Composter."
		   	]
		},
		{
			"name": "Villagers Follow Emeralds",
			"image": "villagers-follow-emeralds.jpg",
			"added": "1.14",
			"desc": [
				"Holding an Emerald Block causes nearby villagers to follow the player, much like animals do for food items."
			]
		},
		{
			"name": "Compasses Work Everywhere",
			"image": "compasses-work-everywhere.jpg",
			"added": "1.14",
			"desc": [
				"Compasses will now work in the Nether and the End.",
				"*In the Nether, a compass will point to the portal you entered from, provided you had it on you when you did.",
				"*In the End, a compass will point to the overworld portal.",
				"*As a bonus, Compasses and Clocks will not function until crafted to prevent cheesing with the recipe book.",
				"*If you prefer, this feature can be configured to only have the anti-cheese, and not the former points, or vice-versa."
			]
		},
		{
			"name": "Campfires Boost Elytra",
			"image": "campfires-boost-elytra.jpg",
			"added": "1.14",
			"desc": [
				"When flying using an Elytra over a Campfire with a Hay Bale under it, the player will be propelled upwards slightly.",
				"1.16.3+ Only: Soul Campfires will have the opposite effect, pulling you quickly towards the ground."
			]
		},
		{
			"name": "Emotes",
			"image": "emotes.jpg",
			"added": "1.14",
            "desc": [
                "In the corner of the Chat menu there's a button to open an emote panel with 12 different emotes your character can do. In this picture, you can see the \"Wave\" emote.",
                "Each emote is also assigned a key binding. Pressing that key will do the emote without you having to open the chat menu. By default all emote keybinds are unset and must be set manually.",
                "A special language is provided to allow for custom emotes to be made. Here's <a href='https://www.youtube.com/watch?v=YBUXMf2juTQ'>an example</a> and <a href='https://www.youtube.com/watch?v=ourHUkan6aQ'>a tutorial</a> on how to do it."
            ]
		},
		{
			"name": "Scaffolding Substitution",
			"image": "scaffolding-substitution.jpg",
			"added": "1.15",
            "desc": [
                "Right clicking on a Scaffold with a block will attempt to place the block at the end of the Scaffold chain. By default it'll turn direction once, so it can build blocks horizontally if you extend scaffolds that way.",
                "If you wish to use the default behaviour of placing blocks on the scaffold, you can still do it with shift-right click."
            ]
		},
		{
			"name": "Infinity Water Bucket",
			"image": "infinity-water-bucket.jpg",
			"added": "1.16",
			"removed": "1.18",
            "desc": [
                "Water Buckets can now be given Infinity through an Anvil. When enchanted like this, if they ever cease to be a water bucket (whether they catch a fish or release the water), they'll immediately revert back to a normal, full, water bucket."
            ]
		},
		{
			"name": "Lava Bucket Trash",
			"image": "lava-bucket-trash.jpg",
			"added": "1.16.4",
			"removed": "1.18",
            "desc": [
                "Items can now be right clicked onto a Lava Bucket to destroy them forever. Shulker Boxes and items that are immune to fire (eg. Netherite) can not be destroyed this way."
            ]
		}
	],
	"world": [
		{
			"name": "Big Stone Clusters",
			"image": "big-stone-clusters.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Variant stone types (such as Andesite, Granite, or Diorite) will now generate in rare massive clusters rather than small nodes that dot the landscape.",
				"The type of clusters you can find underground vary by biome. If you want to know the distribution, click on More Info."
			],
			"expand": [
				"#Vanilla Stones",
				"*Granite will spawn in Mountain and Hill biomes.",
				"*Diorite will spawn in Savanna, Jungle, and Mushroom biomes.",
				"*Andesite will spawn in Forest biomes.",
				"#Quark Stones",
				"*Marble will spawn in Plains biomes.",
				"*Limestone will spawn in Swamp and Ocean biomes.",
				"*Jasper will spawn in Mesa and Desert biomes.",
				"*Slate will spawn in cold biomes.",
				"*Voidstone will spawn in any end biome (Pre 1.16 it's Basalt, which spawns in any nether biome).",
				"*1.16.3+: Myalite will spawn in end highlands.",
				"Note that the distributions are for biome types, not specific biomes. For example, Andesite will also spawn in Birch Forests, Dark Forests, etc."
			]
		},
		{
			"name": "Quark Stone Clusters",
			"image": "big-stone-clusters-1.18.jpg",
			"added": "1.18",
			"desc": [
				"Quark's variant stone types (such as Limestone, Jasper, and Shale) generate in rare massive clusters rather than small nodes that dot the landscape.",
				"The type of clusters you can find underground vary by biome. If you want to know the distribution, click on More Info."
			],
			"expand": [
				"*Limestone will spawn in Swamp and Ocean biomes.",
				"*Jasper will spawn in Mesa and Desert biomes.",
				"*Shale will spawn in cold biomes.",
				"*Myalite will spawn in end highlands.",
				"*Additionally, Quark also generates big clusters of Calcite, which will spawn in Mountains.",
				"Note that the distributions are for biome types, not specific biomes. For example, Limestone will also spawn in Cold Oceans, Warm Oceans, etc."
			]
		},
		{
			"name": "Biotite",
			"image": "biotite.jpg",
			"added": "1.14",
			"removed": "1.18",
            "desc": [
                "Ender Biotite is a renewable ore that does not spawn naturally. Clusters of it will, instead, get scattered across the main End island when an Ender Dragon dies.",
                "Similarly to Nether Quartz, Ender Biotite drops an item, which can be used for crafting or to create Decorative Biotite Blocks, black quartz style blocks."
            ]
		},
		{
			"name": "Cave Roots",
			"image": "cave-roots.jpg",
			"added": "1.14",
			"removed": "1.18",
            "desc": [
                "Cave Roots will now spawn on the walls of caves. These blocks look like dried vines, but you can't climb them.",
                "Breaking the roots has a chance to drop a Cave Root item, which you can eat, but takes longer to. Cave Root can also be brewed into a potion that gives you the Resistance effect. You can harvest the root blocks with Shears.",
                "Roots will grow downwards, and potentially create more Sprouts, if left in an area with light level dark enough to spawn mobs."
            ]
		},
		{
			"name": "Deepslate Backport",
			"image": "deepslate-backport.jpg",
			"added": "1.16.4",
			"removed": "1.18",
            "desc": [
                "Deepslate and Smooth Basalt have been backported to 1.16. Deepslate will now generate in a sheet at the bottom of the world, and the sheet is topped with a layer of Smooth Basalt.",
                "While this may be a nerf to strip mining, ores will be outlined with stone, generally making them easier to find.",
                "All block variants from Vanilla are available, such as Polished and Chiseled Deepslate, as well as their respective Vertical Slabs."
            ]
		},
		{
			"name": "New Stone Types",
			"image": "new-stone-types.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Six new stone types are added to your world.",
				"Pictured in the screenshot:",
				"*Top layer: Slate, Voidstone, Myalite (1.16.3+ only)",
				"*Bottom layer: Limestone, Marble, Jasper",
				"Most of these generate in the overworld. Voidstone and Myalite generate in the end and are immune to the dragon.",
				"Note: Prior to 1.16, Voidstone was known as Basalt and spawned in the nether."
			]
		},
		{
			"name": "New Stone Types",
			"image": "new-stone-types-1.18.jpg",
			"added": "1.18",
			"desc": [
				"Four new stone types are added to your world.",
				"Pictured in the screenshot:",
				"*Top layer: Shale, Myalite",
				"*Bottom layer: Limestone, Jasper",
				"Most of these generate in the overworld. Myalite generates in the end and is immune to the dragon. Myalite also has a slight color tinting property based on its position, shifting between several hues of purple."
			]
		},
		{
			"name": "Speleothems",
			"image": "speleothems.jpg",
			"added": "1.14",
			"removed": "1.18",
            "desc": [
                "Speleothems (commonly known as Stalactites and Stalagmites) will generate in caves and the Nether, in all stone type variants. These can be harvested only with Silk Touch (or crafted, if you want), and can grow up to 3 blocks high.",
                "If you break the supporting blocks, the rest of the structure falls apart, which is super satisfying to do.",
				"1.16.4+ Only: Small Speleothems now increase fall damage by 50%. Perfect for mob farms!"
            ]
		},
		{
			"name": "Underground Biome: Brimstone",
			"image": "underground-biome-brimstone.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"A new underground biome that spawns under Mesas - It comes with Obsidian, Lava and Cobblestone, and the new Brimstone block. Be careful to not fall in!",
				"The Brimstone blocks can be turned into Bricks, and used for Slabs, Stairs, and Walls. They have a very strong orange look, which can compliment nether or fiery builds."
			]
		},
		{
			"name": "Underground Biome: Corundum",
			"image": "underground-biome-crystal-cave.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"A new underground biome that spawns under any biome that isn't an Ocean - It comes with new Corundum Crystals, fancy semi-transparent, light emitting blocks.",
				"Corundum can also be turned into pane variants, and crafted into Colored Runes (from the Tools category), if enabled. The Cluster variants can be used to redirect beacon beams and change their color.",
				"Furthermore, if placed deep underground, they'll grow up to 4 blocks tall, and will emit some particles to let you know they're growing. This growth can be prevented by using honeycomb to wax them, with the wax being removable with an axe."
			],
			"expand": [
				"#Beacon Redirection",
				"!img/features/world/underground-biome-corundum/beam-redirection.png",
				"#Waxed Corundum Comparison",
				"!img/features/world/underground-biome-corundum/waxed-corundum.png",
				"Note: Prior to 1.16.4, these were called Cave Crystals, with a different look."
			]
		},
		{
			"name": "Corundum",
			"image": "corundum.jpg",
			"added": "1.18",
			"desc": [
				"Corundum Crystals are fancy semi-transparent, light emitting blocks that spawn in clusters above Deepslate in biome that isn't an Ocean.",
				"Corundum can also be turned into pane variants, and crafted into Colored Runes (from the Tools category), if enabled.",
				"Furthermore, if placed deep underground, they'll grow up to 4 blocks tall, and will emit some particles to let you know they're growing. This growth can be prevented by using honeycomb to wax them, with the wax being removable with an axe."
			],
			"expand": [
				"#Waxed Corundum Comparison",
				"!img/features/world/underground-biome-corundum/waxed-corundum-1.18.png"
			]
		},
		{
			"name": "Underground Biome: Elder Prismarine",
			"image": "underground-biome-elder-prismarine.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"A new underground biome that spawns under Oceans - It comes with new Elder Prismarine blocks, which look like Prismarine, but with the Elder Guardian palette.",
				"Elder Prismarine only spawns in the rough variant, but has the same variants Prismarine has. Elder Sea Lanterns will also spawn sporadically.",
				"Once you have acquired some Elder Prismarine, you can combine it with normal Prismarine to make more of it."
			]
		},
		{
			"name": "Underground Biome: Glowshroom",
			"image": "underground-biome-glowshroom.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"A new underground biome that spawns under Mushroom Islands and Mountains - It comes with the new Glowcelium and Glowshroom blocks.",
				"Glowcelium is a glowing variant of Mycelium. It'll spread to adjacent dirt blocks, and can host Glowshrooms. Glowshrooms will also spread slowly when planted on Glowcelium.",
				"Glowshrooms can be placed in a Flower Pot, bone mealed to make a Giant Glowshroom, or brewed into a Potion of Danger Sight. When under Danger Sight, areas in which monsters could spawn are highlighted to the player with particle effects."
			],
			"expand": [
				"#Giant Glowshroom",
				"!img/features/world/underground-biome-glowshroom/big-glowshroom.jpg",
				"#Danger Sight",
				"!img/features/world/underground-biome-glowshroom/danger-sight.jpg"
			]
		},
		{
			"name": "Underground Biome: Lush",
			"image": "underground-biome-lush.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"A new underground biome that spawns under Jungles - It comes with some foliage and vines to liven up your caving."
			]
		},
		{
			"name": "Underground Biome: Overgrown",
			"image": "underground-biome-overgrown.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"A new underground biome that spawns under Forests - It comes with trees that stretch to the ceiling and a leaf canopy that covers the cave roof, as well as a Mossy Stone and Coarse Dirt floor."
			]
		},
		{
			"name": "Underground Biome: Permafrost",
			"image": "underground-biome-permafrost.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"A new underground biome that spawns under snowy biomes - It comes with Packed Ice, and the new Permafrost block.",
				"The Permafrost blocks can be turned into Bricks, and used for Slabs, Stairs, and Walls. They have a calming blue, which can go well in cold themed builds."
			]
		},
		{
			"name": "Permafrost",
			"image": "permafrost.jpg",
			"added": "1.18",
			"desc": [
				"A new block that spawns together with Packed Ice underground towards the layers of Frozen Peaks biomes.",
				"The Permafrost blocks can be turned into Bricks, and used for Slabs, Stairs, and Walls. They have a calming blue, which can go well in cold themed builds."
			]
		},
		{
			"name": "Underground Biome: Sandstone",
			"image": "underground-biome-sandstone.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"A new underground biome that spawns under Deserts - It comes with a bunch of Sand, Sandstone, and some dead bushes."
			]
		},
		{
			"name": "Underground Biome: Slime",
			"image": "underground-biome-slime.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"A new underground biome that spawns under Swamps - It comes with a few colors of Terracotta, a flooded floor, and a bunch of Slime!",
				"Note that this biome is much rarer than the other ones, but if you manage to find one, you'll be swimming in Slime Blocks for life."
			]
		},
		{
			"name": "Underground Biome: Spider Nest",
			"image": "underground-biome-spider-nest.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"A new underground biome that spawns under Plains - It comes with a worn down look, including Cobwebs, and a new Cobbedstone block. Cobbedstone can be turned into Slabs, Stairs, and Walls.",
				"Furthermore, if a zombie would spawn on Cobbedstone (even from a spawner), you'll instead get a new mob, the Wrapped. This is a simple zombie variant that inflicts Slowness on hit, but the real spice comes from it having a high chance to drop Cobwebs when killed. This not only allows for a Cobweb farm, but gives a good purpose to Zombie spawners, hurray!"
			],
			"expand": [
				"#Wrapped",
				"!img/features/world/underground-biome-spider-nest/wrapped.jpg"
			]
		},
		{
			"name": "Underground Clay",
			"image": "underground-clay.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Clay generates in patches underground, similarly to Dirt, albeit less often.",
				"We apologize in advance for any breaks in balance you may encounter from this feature."
			]
		},
		{
			"name": "Blossom Trees",
			"image": "blossom-trees.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Blossom Trees are new uncommon specimen in esoteric colors that dot your landscape. Each color of tree will spawn in different types of biomes:",
				"*Frosty Blossom Trees (blue) spawn in cold biomes.",
				"*Serene Blossom Trees (lavender) spawn in swamps.",
				"*Warm Blossom Trees (orange) spawn in savannas.",
				"*Sweet Blossom Trees (pink) spawn in mountains.",
				"*Sunny Blossom Trees (yellow) spawn in plains.",
				"*1.16.3+: Fiery Blossom Trees (red) spawn in badlands.",
				"The trees come with spruce wood and pretty leaves, as well as new saplings you can put in flower pots for decor."
			]
		},
		{
			"name": "Blossom Oaks",
			"image": "blossom-oaks.jpg",
			"added": "1.18",
			"desc": [
				"Blossom Oaks are new uncommon specimen in esoteric colors that dot your landscape. Each color of tree will spawn in different types of biomes:",
				"*Frosty Blossom Oaks (blue) spawn in cold biomes.",
				"*Serene Blossom Oaks (lavender) spawn in swamps.",
				"*Warm Blossom Oaks (orange) spawn in savannas.",
				"*Sweet Blossom Oaks (pink) spawn in mountains.",
				"*Sunny Blossom Oaks (yellow) spawn in plains.",
				"*Fiery Blossom Oaks (red) spawn in badlands.",
				"The trees come with pretty leaves, as well as new saplings you can put in flower pots for decor."
			]
		},
		{
			"name": "Mega Caves",
			"image": "mega-caves.jpg",
			"added": "1.14",
			"removed": "1.18",
			"desc": [
				"Extremely rare massive caves will now spawn underground. These caves are purposely empty, so you can fill them with your imagination. Secret evil lair anyone?"
			]
		}, 
		{
			"name": "Monster Boxes",
			"image": "monster-boxes.jpg",
			"added": "1.14",
			"desc": [
				"Monster Boxes are new blocks you may find randomly scattered around caves deep underground. When you get near one, it'll start spawning a few mobs, and then break.",
				"Mobs you kill that are spawned from one of these get an extra loot table tacked onto them, including cool rare items like Infested Blocks (the ones with Silverfish!), ores, and even a Monster Box you can use to prank your friends!"
			]
		},
		{
			"name": "Nether Obsidian Spikes",
			"image": "nether-obsidian-spikes.jpg",
			"added": "1.14",
			"desc": [
				"Obsidian spikes will now decorate the nether's lava floors. Rarely, you may find a big one with a light in the top, like in the picture. If you choose to climb it, you'll be treated with a loot chest and a Blaze spawner under it."
			]
		},
		{
			"name": "Mega Dungeons",
			"image": "mega-dungeons.jpg",
			"added": "1.14",
			"desc": [
				"Mega dungeons are new massive, rare, dungeons you can find underground. These come with a large variety of different rooms and mini challenges, as well as a shower of loot and monsters to fight.",
				"By default, these will spawn roughly half as often as Pillager Outposts.",
				"If you click on the More Info button, you can see an X-Ray shot of one of these dungeons as a demonstration of how large they can be."
			],
			"expand": [
				"#X-Ray Shot",
				"!img/features/world/mega-dungeons/xray.jpg"
			]
		},
		{
			"name": "Crevices",
			"image": "crevices.jpg",
			"added": "1.15",
			"removed": "1.18",
			"desc": [
				"Crevices are a new underground cave feature you'll find uncommonly while caving. You could think of them as a sideways ravine."
			]
		},
		{
			"name": "Fairy Rings",
			"image": "fairy-rings.jpg",
			"added": "1.15",
			"desc": [
				"Rarely in Forests and Plains (rarer), you may find little flower circles. Should you dig in the center, you'll find some emeralds or diamonds!"
			]
		},
		{
			"name": "Realistic World Type",
			"image": "realistic-world-type.jpg",
			"added": "1.16",
			"removed": "1.18",
			"desc": [
				"A new \"Realistic\" world type is added at world selection, featuring somewhat realistic terrain while still feeling minecrafty. Expect rolling hills and tall mountains. A large biomes variant is also available. (1.16.4+ only)",
				"If you want to use it in a server, set your level type in the server properties to \"quark:realistic\", or \"quark:realistic_large_biomes\". (omit the \"quark:\" part prior to 1.16.4)",
				"Credit where credit is due: This world type is based on Soniop's realistic preset, which you can find <a href='https://www.reddit.com/r/Minecraft/comments/4nfw3t/more_realistic_generation_preset_in_comment/'>here</a>, alongside an album of what you can expect! Additionally, the feature was re-implemented in the 1.16 system by SuperCoder79!"
			]
		},
		{
			"name": "Chorus Vegetation",
			"image": "chorus-vegetation.jpg",
			"added": "1.16.3",
			"desc": [
				"Uncommon patches of new Chorus Weeds and Chorus Twist blocks will now spawn on the outer end. These blocks may look unassuming, but have all sorts of ender properties.",
				"*They randomly teleport every now and then, and when doing so, have a tiny chance to reproduce.",
				"*When trampled by a living being that isn't an enderman or endermite, they'll always teleport. This has a tiny chance to spawn an endermite.",
				"*When water is adjacent to them, they'll try and teleport out of the wet situation.",
				"*Bone meal can be used to force the block to teleport with a guaranteed chance of reproducing itself."
			]
		},
		{
			"name": "Spiral Spires",
			"image": "spiral-spires.jpg",
			"added": "1.16.3",
			"desc": [
				"Spiral Spires are new uncommon setpieces that spawn in the outer end. Atop these large obsidian spires, you'll find new Myalite Crystal blocks arranged in a spiral.",
				"Myalite Cystals can be used as a decoration, or to create Myalite Viaducts - a way to allow ender pearls to be used to phase through solid blocks. Click on More Info to see how they work.",
				"Lastly, if the Corundum feature is enabled, placing Myalite Crystals below any Corundum block that can grow, has the Myalite Crystal grow instead."
			],
			"expand": [
				"-",
				"#Myalite Viaducts",
				"Myalite Viaducts redirect ender teleportations (caused by ender pearls or endermen teleporting), if an ender teleportation would result in the target being placed on an edge of a Myalite Viaduct, said entity would instead end up at the other edge.",
				"!img/features/world/spiral-spires/myalite-viaducts.jpg",
				"Viaducts have some rules applied to determine where a teleport would end:",
				"*Viaducts longer than 24 blocks, or that would cause a loop are illegal, and will just have the teleport go through as normal.",
				"*On a fork, the destination is chosen randomly.",
				"*It's possible a fork can lead to an illegal viaduct on one side, and a legal one on the other side. The results are handled independently. (e.g. a fork with an illegal loop on the left and a normal end on the right has a 50% chance to teleport to the right, and a 50% to leave you at the start)",
				"*Yes, you can move them with pistons."
			]
		}
	],
	"oddities": [
		{
			"addon": true,
			"info": "Note: This module is an Addon, and is not included with base Quark.<br>If you want these features, you can <a href='https://www.curseforge.com/minecraft/mc-mods/quark-oddities'>install it separately</a>, just like you would Quark."
		},
		{
			"name": "Magnets",
			"image": "magnets.jpg",
			"added": "1.15",
			"desc": [
				"Magnets are new technical blocks that can move metallic blocks. A metallic block is defined as block made of Iron or Copper Ingots (1.18+), or made of things made of Iron or Copper Ingots. When powered, the front (red) side of the Magnet will push blocks forward like a piston, whereas the back side will pull blocks towards it.",
				"When multiple Magnets are exerting force upon the same block, the one with the biggest force wins. A magnet's force upon a block is the redstone level applied to it, minus the distance.",
				"Check out More Info for blocks that do special things when moved."
			],
			"expand": [
				"-",
				"#Blocks with Custom Behaviours",
				"*When a Hopper is moved, it'll drop one of its items directly in front of it. If this item is a seed, it'll plant it either directly in front or one block down.",
				"*When a Stonecutter is moved, it'll break any block that's above it. Very hard blocks such as Obsidian can't be broken like this.",
				"*When a Cauldron is moved, the items inside will move with it. (This isn't really a custom behaviour, because any concave block will do this, but it was worth noting)"
			]
		},
		{
			"name": "Pipes",
			"image": "pipes.jpg",
			"added": "1.15",
			"removed": "1.18",
			"desc": [
				"Item Pipes are crafted using some Iron and Glass. As you would expect, they transport items from point A to point B. To get items into a pipe simply use a Hopper, Dropper, or any other insertion means you may have handy.",
				"Item Pipes are rudimentary and don't include any filtering or pathing for items. The way items flow in pipes is based in a small set of rules.",
				"If you want to know more about how Item Pipes work and how the items flow in them, press More Info."
			],
			"expand": [
				"-",
				"#Pathing Rules",
				"Apply the following rules, in order, to determine where an item will go when in a pipe:",
				"*Items will move down if possible:",
				"!img/features/oddities/pipes/rule1.jpg",
				"*Items will move forward if possible:",
				"!img/features/oddities/pipes/rule2.jpg",
				"*At an intersection, items will randomly flow left or right:",
				"!img/features/oddities/pipes/rule3.jpg",
				"*Items will not go upwards unless that's the only possibility:",
				"!img/features/oddities/pipes/rule4.jpg",
				"*Items attempting to enter a full container will bounce back (1.16+ only: Items bouncing back from pipes remember which direction they came into the pipe, and will avoid that direction):",
				"!img/features/oddities/pipes/rule5.jpg",
				"*Items will not flow into disabled (powered) pipes:",
				"!img/features/oddities/pipes/rule6.jpg",
				"*Items will fall out of pipes with momentum and enter pipes with open ends:",
				"!img/features/oddities/pipes/rule7.jpg",
				"-",
				"#Other Tips",
				"*Comparators can read how many items are in a pipe:",
				"!img/features/oddities/pipes/tip1.jpg",
				"*A pipe with 15 or more items inside at once will break:",
				"!img/features/oddities/pipes/tip2.jpg"
			]
		},
		{
			"name": "Copper Pipes",
			"image": "copper-pipes.jpg",
			"added": "1.18",
			"desc": [
				"Copper Pipes are crafted using some Copper Ingots and Glass. As you would expect, they transport items from point A to point B. To get items into a pipe simply use a Hopper, Dropper, or any other insertion means you may have handy.",
				"Copper Pipes are rudimentary and don't include any filtering or pathing for items. The way items flow in pipes is based in a small set of rules.",
				"If you want to know more about how Copper Pipes work and how the items flow in them, press More Info."
			],
			"expand": [
				"-",
				"#Pathing Rules",
				"Apply the following rules, in order, to determine where an item will go when in a pipe:",
				"*Items will move down if possible:",
				"!img/features/oddities/pipes/copper-rule1.jpg",
				"*Items will move forward if possible:",
				"!img/features/oddities/pipes/copper-rule2.jpg",
				"*At an intersection, items will randomly flow left or right:",
				"!img/features/oddities/pipes/copper-rule3.jpg",
				"*Items will not go upwards unless that's the only possibility:",
				"!img/features/oddities/pipes/copper-rule4.jpg",
				"*Items attempting to enter a full container will bounce back (1.16+ only: Items bouncing back from pipes remember which direction they came into the pipe, and will avoid that direction):",
				"!img/features/oddities/pipes/copper-rule5.jpg",
				"*Items will not flow into disabled (powered) pipes:",
				"!img/features/oddities/pipes/copper-rule6.jpg",
				"*Items will fall out of pipes with momentum and enter pipes with open ends:",
				"!img/features/oddities/pipes/copper-rule7.jpg",
				"-",
				"#Other Tips",
				"*Comparators can read how many items are in a pipe:",
				"!img/features/oddities/pipes/copper-tip1.jpg",
				"*A pipe with 15 or more items inside at once will break:",
				"!img/features/oddities/pipes/copper-tip2.jpg"
			]
		},
		{
			"name": "Backpack",
			"image": "backpack.jpg",
			"added": "1.15",
			"desc": [
				"Should you find yourself slaying a Ravager in a raid, you'll get a rare drop of Ravager Hide. The Ravager will always drop one, but may drop more depending on your level of Looting.",
				"This Backpack can be worn in the Chest slot, and it'll give you a bunch of extra slots in your inventory to store all your stuff. Note that the backpack does not provide any protection, nor is it enchantable. Ravager Hide is extremely resistant, though, so it'll never break!",
				"Beware however, if your backpack has items in it, you can't unequip it, and if you die with it, all the items will scatter. You may also dye the backpack just like any other leather armor."
			]
		},
		{
			"name": "Totem of Holding",
			"image": "totem-of-holding.jpg",
			"added": "1.15",
			"desc": [
				"When a player dies, a Totem of Holding will spawn at the dead player's position. This totem will float around in the air, holding the player's items. Any player can retrieve the items the totem is holding by punching it a few times. (The totem won't spawn for PVP kills)",
				"Do note that if the player who spawned the totem dies again, the totem will break and drop all of the items on the ground, like a normal death. The totem isn't an item - it just shows up for you.",
				"A player's totem can be located by crafting a Soul Compass, which is done using a Compass and a Soul Bead (from Wraiths, in the Mobs category; replace with an Ender Pearl if Wraiths are disabled)."
			]
		},
		{
			"name": "Matrix Enchanting",
			"image": "matrix-enchanting.jpg",
			"added": "1.15",
			"desc": [
				"Matrix Enchanting is a complete overhaul of the enchanting system. Pieces can be generated using lapis and XP. The pieces then have to be laid on the grid to enchant the item. Pieces can be rotated and upgraded into higher levels.",
				"Furthermore, the enchanting table can now hold Lapis and the item you put in. The item will even render in the world! You can enchant underwater too.",
				"If you want to know more about how to use Matrix Enchanting, press More Info."
			],		
			"expand": [
				"-",
				"#Basic Points",
				"*Lapis can be placed in the the bottom-left slot. The lapis is stored as a \"charge\" meter, which you can see in the left blue bar.",
				"*You can press the <b>+</b> button to generate new pieces. Each piece will contain an enchantment.",
				"*The pieces you generate will land in the docket, the rightmost side bar.",
				"*You can pick pieces from the docket and put them in the grid. Pieces put in the grid will affect the output enchantment.",
				"*You can rotate pieces by right clicking.",
				"*Generated pieces always come at enchantment level 1. To upgrade a piece you placed down in the grid, simply grab one with the same enchantment and click it on top of the placed one.",
				"-",
				"#Tips",
				"*Incompatible pieces can never be generated - if you see a Fortune piece, you'll never see Silk Touch in that session.",
				"*The item you're enchanting will retain its pending enchantments if you take it out.",
				"*Candles can be used those to manipulate what type of enchantments you'd like to get. Placing down up to 4 candles of a single type will enhance the chance you'll find a given enchantment.",
				"-",
				"#Candle Influences",
				"*White: Unbreaking",
				"*Orange: Fire Protection",
				"*Magenta: Knockback, Punch",
				"*Light Blue: Feather Falling",
				"*Yellow: Looting, Fortune, Luck of the Sea",
				"*Lime: Blast Protection",
				"*Pink: Silk Touch, Channeling",
				"*Gray: Bane of Arthropods",
				"*Light Gray: Protection",
				"*Cyan: Respiration, Loyalty, Infinity",
				"*Purple: Sweeping Edge, Multishot",
				"*Blue: Efficiency, Sharpness, Lure, Power, Impaling, Quick Charge",
				"*Brown: Aqua Affinity, Depth Strider, Riptide",
				"*Green: Thorns, Piercing",
				"*Red: Fire Aspect, Flame",
				"*Black: Smite, Projectile Protection"
			]
		},
		{
			"name": "Crate",
			"image": "crate.jpg",
			"added": "1.16.4",
			"desc": [
				"The Crate is an alternative storage block that can hold up to 640 items, regardless of stack size. A full stack of an item will take up 64, but 64 different items will also take up the same amount.",
				"This makes the crate not very good for storing bulk items, but excellent for storing a high variety of items in one spot, or for collecting unstackables."
			]
		}
	],
	"friends": [
		{
			"addon": true,
			"info": "These are separate mods you can get that enhance your experience! They're curated and in the same style as Quark. Note that despite them being promoted here, they're not officially supported by Quark. Are you a modder? <a href='https://github.com/Vazkii/Quark/issues/1939'>Add yours!</a>",
			"hide_count": true
		},
		{
			"name": "Allurement",
			"image": "allurement.jpg",
			"custom_version": "Friend",
			"desc": [
				"Allurement shakes up the endgame meta by adding new alternatives to enchants to allow for more player choice."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/allurement"
		},
		{
			"name": "Atmospheric",
			"image": "atmospheric.jpg",
			"custom_version": "Friend",
			"desc": [
				"Atmospheric is a mod designed to create new and fun experiences in brand new biomes, each with specialized and unique content. With new forests, deserts, and more, there are tons of new things to discover. There are plenty of new wood types and other building blocks to obtain as well."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/atmospheric"
		},
		{
			"name": "Autumnity",
			"image": "autumnity.jpg",
			"custom_version": "Friend",
			"desc": [
				"Autumnity adds a maple forest with many different colors of maple trees, each with falling leaves. Within this forest, snails can be found which can make snail slime. Maple trees can also produce maple sap which can be made to make maple syrup and pancakes."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/autumnity"
		},
		{
			"name": "Buzzier Bees",
			"image": "buzzier-bees.jpg",
			"custom_version": "Friend",
			"desc": [
				"Buzzier Bees is designed to expand upon 1.15 - the Buzzy Bees update. Introducing bee themed building blocks, bottles of bugs, candles (that don't interfere with Quark's), scented candles, and variant beehives for each wood type, with mod support too."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/buzzier-bees"
		},
    	{
			"name": "Berry Good",
			"image": "berry-good.jpg",
			"custom_version": "Friend",
			"desc": [
				"Berry Good is a small mod focusing on fixing the annoying placement of Sweet Berries in addition to fleshing them out a little more."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/berry-good"
		},
		{
			"name": "Environmental",
			"image": "environmental.jpg",
			"custom_version": "Friend",
			"desc": [
				"Environmental overhauls and improves many vanilla biomes, and adds a few new ones too! There's also a good few \"extra\" features thrown in for good measure."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/environmental"
		},
		{
			"name": "Extra Boats",
			"image": "extra-boats.jpg",
			"custom_version": "Friend",
			"desc": [
				"Extra Boats adds more content for ocean travellers. Chest boats, furnace boats, and large boats can be obtained with compatibility and variants for other mods' wood types."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/extra-boats"
		},
		{
			"name": "Neapolitan",
			"image": "neapolitan.jpg",
			"custom_version": "Friend",
			"desc": [
				"Neapolitan adds Chocolate, Vanilla, and Strawberries. These all come with tons of food types and recipes, including ice cream, milkshakes, cakes, and more!"
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/neapolitan"
		},
		{
			"name": "Personality",
			"image": "personality.jpg",
			"custom_version": "Friend",
			"desc": [
				"Personality adds sitting, crawling, and a few new animations, with more coming soon!"
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/autumnity"
		},
		{
			"name": "Savage & Ravage",
			"image": "savage-and-ravage.jpg",
			"custom_version": "Friend",
			"desc": [
				"Savage and Ravage aims to improve and expand on everything Illager-related through new structures, enemies and challenges. So far it adds a better raid starting mechanic, changes to pillagers, creeper-related features and more."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/savage-and-ravage"
		},
		{	
			"name": "The Endergetic Expansion",	
			"image": "endergetic.jpg",	
			"custom_version": "Friend",	
			"desc": [	
				"The Endergetic Expansion's aim is to improve every aspect of the end. It already adds an entire biome with unique mechanics, mobs, and visuals, as well as visual improvements to the existing end well and end gateways used to teleport in vanilla. The poise forest can be located semi-rarely in the outer islands of the end (where the chorus biome can also spawn)."	
			],	
			"download": "https://www.curseforge.com/minecraft/mc-mods/endergetic"	
		},
		{
			"name": "Upgrade Aquatic",
			"image": "upgrade-aquatic.jpg",
			"custom_version": "Friend",
			"desc": [
				"Upgrade Aquatic extends and improves on the content added by 1.13. Improving oceans and fixing the implementation of insomnia, in addition to fleshing out rivers and providing new decorative options."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/upgrade-aquatic"
		},
		{
			"name": "Abundance",
			"image": "abundance.jpg",
			"custom_version": "Friend",
			"desc": [
				"Abundance adds the Lavender Fields, a gorgeous new biome full of color trees, as well as Lavender! It also adds all sorts of new flowering things to existing biomes - like new flowers, flowering Redbud trees, and Saguaro Cacti."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/abundance"
		},
		{
			"name": "Bayou Blues",
			"image": "bayou-blues.jpg",
			"custom_version": "Friend",
			"desc": [
				"Bayou Blues adds the Bayou, a new biome inspired by the swamps of Florida! It's full of foliage such as cypress trees, beard moss, algae, lily flowers, and gooseberries."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/bayou-blues"
		},
		{
			"name": "Better Badlands",
			"image": "better-badlands.jpg",
			"custom_version": "Friend",
			"desc": [
				"Better Badlands improves Minecrafts badlands biome with better generation and new blocks."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/better-badlands"
		},
    		{
			"name": "Enhanced Mushrooms",
			"image": "enhanced-mushrooms.jpg",
			"custom_version": "Friend",
			"desc": [
				"Enhanced Mushrooms adds new wood types for both vanilla mushroom types. It also includes a transparent, glowing wood type for glowshrooms when Quark is installed, and has a couple of new mushroom-related foods."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/enhanced-mushrooms"
		},
		{
			"name": "Fruitful",
			"image": "fruitful.jpg",
			"custom_version": "Friend",
			"desc": [
				"Fruitful overhauls how apples are gathered and farmed. It also adds baked apples and a new effect to encourage eating them."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/fruitful"
		},
		{
			"name": "Charm",
			"image": "charm.jpg",
			"custom_version": "Friend",
			"desc": [
				"Charm enhances the vanilla game experience without compromising its gameplay style, adding extra features with a similar feel to Quark."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/charm-reforged"
		},
		{
			"name": "Inspirations",
			"image": "inspirations.jpg",
			"custom_version": "Friend",
			"desc": [
				"Adds many small features to Minecraft in a modular way. Contains features such as functional bookshelves, carpeted stairs, enchantable shields, colored nether portals, simple item pipes, climbable ropes, and more. See the mod description for more information. "
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/inspirations"
		},
		{
			"name": "Simply Tea!",
			"image": "simply-tea.jpg",
			"custom_version": "Friend",
			"desc": [
				"Adds tea trees to the game, the leaves of which can be crafted into drinkable tea that provides passive effects."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/simply-tea"
		},
		{
			"name": "V-Tweaks",
			"image": "vtweaks.jpg",
			"custom_version": "Friend",
			"desc": [
				"Adds dozens of tweaks to the game without adding any new items. V-Tweaks accomplishes this by adding a couple of enchantments and adding new interactions that the player can have. These interactions vary from entity tweaks, block tweaks, item tweaks and overall improvements."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/v-tweaks"
		},
		{
			"name": "Voyage",
			"image": "voyage.jpg",
			"custom_version": "Friend",
			"desc": [
				"Voyage adds a multitude of new biomes to go alongside the vanilla ones, without adding any new blocks or items. It includes lagoons, rock fields, tall mountains, and much more."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/voyage"
		},
		{
			"name": "YUNG's Better Caves",
			"image": "yungs-better-caves.jpg",
			"custom_version": "Friend",
			"desc": [
				"YUNG's Better Caves is a powerful and customizable Minecraft cave mod. Completely overhauls cave generation to add vast lava seas, flooded caverns, and underground lakes and rivers."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/yungs-better-caves"
		},
		{
			"name": "YUNG's Better Mineshafts",
			"image": "yungs-better-mineshafts.jpg",
			"custom_version": "Friend",
			"desc": [
				"YUNG's Better Mineshafts completely revamps vanilla abandoned mineshafts, changing them from boring straight lines into dynamic, varied webs of tunnels."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/yungs-better-mineshafts-forge"
		},
    {
			"name": "YUNG's Better Strongholds",
			"image": "yungs-better-strongholds.jpg",
			"custom_version": "Friend",
			"desc": [
				"A complete redesign of Minecraft strongholds like never before, making them much more complex and exciting while still staying true to vanilla themes. Features over 15 different rooms, various types of tunnels and hallways, staircases, traps, and even hidden areas!"
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/yungs-better-strongholds"
		},
		{
			"name": "YUNG's Extras",
			"image": "yungs-extras.jpg",
			"custom_version": "Friend",
			"desc": [
				"A myriad of structures, features, and vanilla+ content. This mod is a collection of upgrades to vanilla Minecraft that are each individually too small for their own mods, but together create a nice finishing touch for your modpack. It's the cherry on top for any modpack."
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/yungs-extras"
		},
    {
			"name": "Supplementaries",
			"image": "supplementaries.jpg",
			"custom_version": "Friend",
			"desc": [
				"Adds many functional and useful blocks, decorations as well as tweaks that expand and complement well the vanilla game"
			],
			"download": "https://www.curseforge.com/minecraft/mc-mods/supplementaries"
    }
	]
}
